# Brewfile managed by chezmoi
# This file is updated from the old nix-darwin configuration.

tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"

# Core Tools
brew "mplayer"
brew "cue"
brew "mas"
brew "neovim"
# Keep the complete native-compilation toolchain explicit so dependencies are
# retained and validated independently of formula transitions.
brew "emacs-plus@32"
brew "gcc"
brew "libgccjit"
brew "tmux"
brew "starship"
brew "gemini-cli"
brew "mise"
brew "direnv"
brew "coreutils"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "bat"
brew "eza"
brew "zoxide"
brew "bottom"
brew "tldr"
brew "cloc"
brew "entr"
brew "git"
brew "difftastic"
brew "delta"
brew "gh"
brew "just"
brew "gnupg"
brew "curl"
brew "wget"
brew "watch"
brew "ffmpeg"
brew "tree"
brew "htop"
brew "mtr"
brew "iftop"
brew "wrk"
brew "pstree"
brew "pandoc"
brew "readline"
brew "graphviz"
brew "rlwrap"
brew "miller"
brew "duf"
brew "broot"
brew "mc"
brew "gdu"
brew "kubectl"
brew "ctop"
brew "hadolint"
brew "pngpaste"
brew "aspell"
brew "yazi"

# Languages (Mise handles these better, but some are good here)
brew "go"
brew "clojure"
brew "pipx"

# Casks (GUI Apps & Fonts)
cask "clipy"
cask "hiddenbar"
cask "meetingbar"
cask "stats"
cask "1password-cli"
cask "temurin" # Java
cask "claude-code"
cask "opensuperwhisper"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-ibm-plex"
cask "font-dejavu-sans-mono-nerd-font"
